In my test, I successfully rotated all VROPS credentials. 
(base) ➜  terraform terraform apply -parallelism=1
╷
│ Warning: Provider development overrides are in effect
│ 
│ The following provider development overrides are set in the CLI configuration:
│  - vmware/vcf in /Users/dz037459/go/bin
│ 
│ The behavior may therefore not match any released version of the provider and applying changes may cause the state to become incompatible with published releases.
╵
module.update-vcf-vrslcm-pwd.data.vcf_credentials.sddc_creds: Reading...
module.update-vcf-vrslcm-pwd.data.vcf_credentials.sddc_creds: Read complete after 1s [id=628aa5a8e94c94ddfd367208bf568e3e]

Terraform used the selected providers to generate the following execution plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.update-vcf-vrslcm-pwd.vault_kv_secret_v2.vault_secrets["sfo-vropsc01a.sfo.rainpole.io-root"] will be created
  + resource "vault_kv_secret_v2" "vault_secrets" {
      + cas                 = 1
      + data                = (sensitive value)
      + data_json           = (sensitive value)
      + delete_all_versions = true
      + disable_read        = false
      + id                  = (known after apply)
      + metadata            = (known after apply)
      + mount               = "vcf"
      + name                = "sfo-vropsc01a.sfo.rainpole.io-root"
      + path                = (known after apply)

      + custom_metadata {
          + data         = {
              + "category"   = "vcf"
              + "system"     = "sfo-vropsc01a.sfo.rainpole.io"
              + "type"       = "SSH"
              + "vcf_domain" = "sfo-m01"
            }
          + max_versions = 100
        }
    }

  # module.update-vcf-vrslcm-pwd.vault_kv_secret_v2.vault_secrets["sfo-vropsc01b.sfo.rainpole.io-root"] will be created
  + resource "vault_kv_secret_v2" "vault_secrets" {
      + cas                 = 1
      + data                = (sensitive value)
      + data_json           = (sensitive value)
      + delete_all_versions = true
      + disable_read        = false
      + id                  = (known after apply)
      + metadata            = (known after apply)
      + mount               = "vcf"
      + name                = "sfo-vropsc01b.sfo.rainpole.io-root"
      + path                = (known after apply)

      + custom_metadata {
          + data         = {
              + "category"   = "vcf"
              + "system"     = "sfo-vropsc01b.sfo.rainpole.io"
              + "type"       = "SSH"
              + "vcf_domain" = "sfo-m01"
            }
          + max_versions = 100
        }
    }

  # module.update-vcf-vrslcm-pwd.vault_kv_secret_v2.vault_secrets["xint-vrops01.rainpole.io-admin"] will be created
  + resource "vault_kv_secret_v2" "vault_secrets" {
      + cas                 = 1
      + data                = (sensitive value)
      + data_json           = (sensitive value)
      + delete_all_versions = true
      + disable_read        = false
      + id                  = (known after apply)
      + metadata            = (known after apply)
      + mount               = "vcf"
      + name                = "xint-vrops01.rainpole.io-admin"
      + path                = (known after apply)

      + custom_metadata {
          + data         = {
              + "category"   = "vcf"
              + "system"     = "xint-vrops01.rainpole.io"
              + "type"       = "API"
              + "vcf_domain" = "sfo-m01"
            }
          + max_versions = 100
        }
    }

  # module.update-vcf-vrslcm-pwd.vault_kv_secret_v2.vault_secrets["xint-vrops01a-root"] will be created
  + resource "vault_kv_secret_v2" "vault_secrets" {
      + cas                 = 1
      + data                = (sensitive value)
      + data_json           = (sensitive value)
      + delete_all_versions = true
      + disable_read        = false
      + id                  = (known after apply)
      + metadata            = (known after apply)
      + mount               = "vcf"
      + name                = "xint-vrops01a-root"
      + path                = (known after apply)

      + custom_metadata {
          + data         = {
              + "category"   = "vcf"
              + "system"     = "xint-vrops01a"
              + "type"       = "SSH"
              + "vcf_domain" = "sfo-m01"
            }
          + max_versions = 100
        }
    }

  # module.update-vcf-vrslcm-pwd.vault_kv_secret_v2.vault_secrets["xint-vrops01b-root"] will be created
  + resource "vault_kv_secret_v2" "vault_secrets" {
      + cas                 = 1
      + data                = (sensitive value)
      + data_json           = (sensitive value)
      + delete_all_versions = true
      + disable_read        = false
      + id                  = (known after apply)
      + metadata            = (known after apply)
      + mount               = "vcf"
      + name                = "xint-vrops01b-root"
      + path                = (known after apply)

      + custom_metadata {
          + data         = {
              + "category"   = "vcf"
              + "system"     = "xint-vrops01b"
              + "type"       = "SSH"
              + "vcf_domain" = "sfo-m01"
            }
          + max_versions = 100
        }
    }

  # module.update-vcf-vrslcm-pwd.vault_kv_secret_v2.vault_secrets["xint-vrops01c.rainpole.io-root"] will be created
  + resource "vault_kv_secret_v2" "vault_secrets" {
      + cas                 = 1
      + data                = (sensitive value)
      + data_json           = (sensitive value)
      + delete_all_versions = true
      + disable_read        = false
      + id                  = (known after apply)
      + metadata            = (known after apply)
      + mount               = "vcf"
      + name                = "xint-vrops01c.rainpole.io-root"
      + path                = (known after apply)

      + custom_metadata {
          + data         = {
              + "category"   = "vcf"
              + "system"     = "xint-vrops01c.rainpole.io"
              + "type"       = "SSH"
              + "vcf_domain" = "sfo-m01"
            }
          + max_versions = 100
        }
    }

  # module.update-vcf-vrslcm-pwd.vcf_credentials_rotate.rotate["sfo-vropsc01a.sfo.rainpole.io-root"] will be created
  + resource "vcf_credentials_rotate" "rotate" {
      + id               = (known after apply)
      + last_rotate_time = (known after apply)
      + once_only        = false
      + resource_name    = "sfo-vropsc01a.sfo.rainpole.io"
      + resource_type    = "VROPS"

      + credentials {
          + credential_type = "SSH"
          + password        = (sensitive value)
          + user_name       = "root"
        }
    }

  # module.update-vcf-vrslcm-pwd.vcf_credentials_rotate.rotate["sfo-vropsc01b.sfo.rainpole.io-root"] will be created
  + resource "vcf_credentials_rotate" "rotate" {
      + id               = (known after apply)
      + last_rotate_time = (known after apply)
      + once_only        = false
      + resource_name    = "sfo-vropsc01b.sfo.rainpole.io"
      + resource_type    = "VROPS"

      + credentials {
          + credential_type = "SSH"
          + password        = (sensitive value)
          + user_name       = "root"
        }
    }

  # module.update-vcf-vrslcm-pwd.vcf_credentials_rotate.rotate["xint-vrops01.rainpole.io-admin"] will be created
  + resource "vcf_credentials_rotate" "rotate" {
      + id               = (known after apply)
      + last_rotate_time = (known after apply)
      + once_only        = false
      + resource_name    = "xint-vrops01.rainpole.io"
      + resource_type    = "VROPS"

      + credentials {
          + credential_type = "API"
          + password        = (sensitive value)
          + user_name       = "admin"
        }
    }

  # module.update-vcf-vrslcm-pwd.vcf_credentials_rotate.rotate["xint-vrops01a-root"] will be created
  + resource "vcf_credentials_rotate" "rotate" {
      + id               = (known after apply)
      + last_rotate_time = (known after apply)
      + once_only        = false
      + resource_name    = "xint-vrops01a"
      + resource_type    = "VROPS"

      + credentials {
          + credential_type = "SSH"
          + password        = (sensitive value)
          + user_name       = "root"
        }
    }

  # module.update-vcf-vrslcm-pwd.vcf_credentials_rotate.rotate["xint-vrops01b-root"] will be created
  + resource "vcf_credentials_rotate" "rotate" {
      + id               = (known after apply)
      + last_rotate_time = (known after apply)
      + once_only        = false
      + resource_name    = "xint-vrops01b"
      + resource_type    = "VROPS"

      + credentials {
          + credential_type = "SSH"
          + password        = (sensitive value)
          + user_name       = "root"
        }
    }

  # module.update-vcf-vrslcm-pwd.vcf_credentials_rotate.rotate["xint-vrops01c.rainpole.io-root"] will be created
  + resource "vcf_credentials_rotate" "rotate" {
      + id               = (known after apply)
      + last_rotate_time = (known after apply)
      + once_only        = false
      + resource_name    = "xint-vrops01c.rainpole.io"
      + resource_type    = "VROPS"

      + credentials {
          + credential_type = "SSH"
          + password        = (sensitive value)
          + user_name       = "root"
        }
    }

Plan: 12 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + last_rotate_time = {
      + "sfo-vropsc01a.sfo.rainpole.io-root" = {
          + last_rotate_time = (known after apply)
        }
      + "sfo-vropsc01b.sfo.rainpole.io-root" = {
          + last_rotate_time = (known after apply)
        }
      + "xint-vrops01.rainpole.io-admin"     = {
          + last_rotate_time = (known after apply)
        }
      + xint-vrops01a-root                   = {
          + last_rotate_time = (known after apply)
        }
      + xint-vrops01b-root                   = {
          + last_rotate_time = (known after apply)
        }
      + "xint-vrops01c.rainpole.io-root"     = {
          + last_rotate_time = (known after apply)
        }
    }

Do you want to perform these actions?
  Terraform will perform the actions described above.
  Only 'yes' will be accepted to approve.

  Enter a value: yes

module.update-vcf-vrslcm-pwd.vcf_credentials_rotate.rotate["xint-vrops01c.rainpole.io-root"]: Creating...
module.update-vcf-vrslcm-pwd.vcf_credentials_rotate.rotate["xint-vrops01c.rainpole.io-root"]: Still creating... [10s elapsed]
module.update-vcf-vrslcm-pwd.vcf_credentials_rotate.rotate["xint-vrops01c.rainpole.io-root"]: Still creating... [20s elapsed]
module.update-vcf-vrslcm-pwd.vcf_credentials_rotate.rotate["xint-vrops01c.rainpole.io-root"]: Still creating... [30s elapsed]
module.update-vcf-vrslcm-pwd.vcf_credentials_rotate.rotate["xint-vrops01c.rainpole.io-root"]: Still creating... [40s elapsed]
module.update-vcf-vrslcm-pwd.vcf_credentials_rotate.rotate["xint-vrops01c.rainpole.io-root"]: Creation complete after 42s [id=1dff5c229662c444a51369ffe2dc1ef6]
module.update-vcf-vrslcm-pwd.vcf_credentials_rotate.rotate["sfo-vropsc01a.sfo.rainpole.io-root"]: Creating...
module.update-vcf-vrslcm-pwd.vcf_credentials_rotate.rotate["sfo-vropsc01a.sfo.rainpole.io-root"]: Still creating... [10s elapsed]
module.update-vcf-vrslcm-pwd.vcf_credentials_rotate.rotate["sfo-vropsc01a.sfo.rainpole.io-root"]: Still creating... [20s elapsed]
module.update-vcf-vrslcm-pwd.vcf_credentials_rotate.rotate["sfo-vropsc01a.sfo.rainpole.io-root"]: Still creating... [30s elapsed]
module.update-vcf-vrslcm-pwd.vcf_credentials_rotate.rotate["sfo-vropsc01a.sfo.rainpole.io-root"]: Still creating... [40s elapsed]
module.update-vcf-vrslcm-pwd.vcf_credentials_rotate.rotate["sfo-vropsc01a.sfo.rainpole.io-root"]: Creation complete after 42s [id=6226a1d2e785867751b7797086cbb418]
module.update-vcf-vrslcm-pwd.vcf_credentials_rotate.rotate["sfo-vropsc01b.sfo.rainpole.io-root"]: Creating...
module.update-vcf-vrslcm-pwd.vcf_credentials_rotate.rotate["sfo-vropsc01b.sfo.rainpole.io-root"]: Still creating... [10s elapsed]
module.update-vcf-vrslcm-pwd.vcf_credentials_rotate.rotate["sfo-vropsc01b.sfo.rainpole.io-root"]: Still creating... [20s elapsed]
module.update-vcf-vrslcm-pwd.vcf_credentials_rotate.rotate["sfo-vropsc01b.sfo.rainpole.io-root"]: Still creating... [30s elapsed]
module.update-vcf-vrslcm-pwd.vcf_credentials_rotate.rotate["sfo-vropsc01b.sfo.rainpole.io-root"]: Still creating... [40s elapsed]
module.update-vcf-vrslcm-pwd.vcf_credentials_rotate.rotate["sfo-vropsc01b.sfo.rainpole.io-root"]: Creation complete after 42s [id=619a665e6d988ed1fb952032e615f2b5]
module.update-vcf-vrslcm-pwd.vcf_credentials_rotate.rotate["xint-vrops01.rainpole.io-admin"]: Creating...
module.update-vcf-vrslcm-pwd.vcf_credentials_rotate.rotate["xint-vrops01.rainpole.io-admin"]: Still creating... [10s elapsed]
module.update-vcf-vrslcm-pwd.vcf_credentials_rotate.rotate["xint-vrops01.rainpole.io-admin"]: Still creating... [20s elapsed]
module.update-vcf-vrslcm-pwd.vcf_credentials_rotate.rotate["xint-vrops01.rainpole.io-admin"]: Still creating... [30s elapsed]
module.update-vcf-vrslcm-pwd.vcf_credentials_rotate.rotate["xint-vrops01.rainpole.io-admin"]: Still creating... [40s elapsed]
module.update-vcf-vrslcm-pwd.vcf_credentials_rotate.rotate["xint-vrops01.rainpole.io-admin"]: Creation complete after 42s [id=912ddbd7bf6e248190e74d99ea0181a5]
module.update-vcf-vrslcm-pwd.vcf_credentials_rotate.rotate["xint-vrops01b-root"]: Creating...
module.update-vcf-vrslcm-pwd.vcf_credentials_rotate.rotate["xint-vrops01b-root"]: Still creating... [10s elapsed]
module.update-vcf-vrslcm-pwd.vcf_credentials_rotate.rotate["xint-vrops01b-root"]: Still creating... [20s elapsed]
module.update-vcf-vrslcm-pwd.vcf_credentials_rotate.rotate["xint-vrops01b-root"]: Still creating... [30s elapsed]
module.update-vcf-vrslcm-pwd.vcf_credentials_rotate.rotate["xint-vrops01b-root"]: Still creating... [40s elapsed]
module.update-vcf-vrslcm-pwd.vcf_credentials_rotate.rotate["xint-vrops01b-root"]: Creation complete after 42s [id=895ebbc8a644437951ac180a6b7ee4a1]
module.update-vcf-vrslcm-pwd.vcf_credentials_rotate.rotate["xint-vrops01a-root"]: Creating...
module.update-vcf-vrslcm-pwd.vcf_credentials_rotate.rotate["xint-vrops01a-root"]: Still creating... [10s elapsed]
module.update-vcf-vrslcm-pwd.vcf_credentials_rotate.rotate["xint-vrops01a-root"]: Still creating... [20s elapsed]
module.update-vcf-vrslcm-pwd.vcf_credentials_rotate.rotate["xint-vrops01a-root"]: Still creating... [30s elapsed]
module.update-vcf-vrslcm-pwd.vcf_credentials_rotate.rotate["xint-vrops01a-root"]: Still creating... [40s elapsed]
module.update-vcf-vrslcm-pwd.vcf_credentials_rotate.rotate["xint-vrops01a-root"]: Creation complete after 42s [id=b20b7d1f9143c5423a61f348070568b4]
module.update-vcf-vrslcm-pwd.vault_kv_secret_v2.vault_secrets["xint-vrops01a-root"]: Creating...
module.update-vcf-vrslcm-pwd.vault_kv_secret_v2.vault_secrets["xint-vrops01a-root"]: Creation complete after 4s [id=vcf/data/xint-vrops01a-root]
module.update-vcf-vrslcm-pwd.vault_kv_secret_v2.vault_secrets["sfo-vropsc01b.sfo.rainpole.io-root"]: Creating...
module.update-vcf-vrslcm-pwd.vault_kv_secret_v2.vault_secrets["sfo-vropsc01b.sfo.rainpole.io-root"]: Creation complete after 1s [id=vcf/data/sfo-vropsc01b.sfo.rainpole.io-root]
module.update-vcf-vrslcm-pwd.vault_kv_secret_v2.vault_secrets["xint-vrops01.rainpole.io-admin"]: Creating...
module.update-vcf-vrslcm-pwd.vault_kv_secret_v2.vault_secrets["xint-vrops01.rainpole.io-admin"]: Creation complete after 2s [id=vcf/data/xint-vrops01.rainpole.io-admin]
module.update-vcf-vrslcm-pwd.vault_kv_secret_v2.vault_secrets["xint-vrops01c.rainpole.io-root"]: Creating...
module.update-vcf-vrslcm-pwd.vault_kv_secret_v2.vault_secrets["xint-vrops01c.rainpole.io-root"]: Creation complete after 1s [id=vcf/data/xint-vrops01c.rainpole.io-root]
module.update-vcf-vrslcm-pwd.vault_kv_secret_v2.vault_secrets["sfo-vropsc01a.sfo.rainpole.io-root"]: Creating...
module.update-vcf-vrslcm-pwd.vault_kv_secret_v2.vault_secrets["sfo-vropsc01a.sfo.rainpole.io-root"]: Creation complete after 2s [id=vcf/data/sfo-vropsc01a.sfo.rainpole.io-root]
module.update-vcf-vrslcm-pwd.vault_kv_secret_v2.vault_secrets["xint-vrops01b-root"]: Creating...
module.update-vcf-vrslcm-pwd.vault_kv_secret_v2.vault_secrets["xint-vrops01b-root"]: Creation complete after 1s [id=vcf/data/xint-vrops01b-root]

Apply complete! Resources: 12 added, 0 changed, 0 destroyed.

Outputs:

last_rotate_time = {
  "sfo-vropsc01a.sfo.rainpole.io-root" = {
    "last_rotate_time" = "2024-08-16T12:33:54+10:00"
  }
  "sfo-vropsc01b.sfo.rainpole.io-root" = {
    "last_rotate_time" = "2024-08-16T12:34:36+10:00"
  }
  "xint-vrops01.rainpole.io-admin" = {
    "last_rotate_time" = "2024-08-16T12:35:18+10:00"
  }
  "xint-vrops01a-root" = {
    "last_rotate_time" = "2024-08-16T12:36:42+10:00"
  }
  "xint-vrops01b-root" = {
    "last_rotate_time" = "2024-08-16T12:36:00+10:00"
  }
  "xint-vrops01c.rainpole.io-root" = {
    "last_rotate_time" = "2024-08-16T12:33:12+10:00"
  }
}